import BlogPost from '../../components/BlogPost'

const Zman = () => {
  const content = `
    1. בעוד קצת יותר מחודש אהיה בן 27 שנים. עשרים ושבע זה כבר מספר, שנות העשרים המאוחרות.<br><br>
    2. בזמן האחרון נהיה לי מנהג\\אובססיה לחשב בויקיפדיה את הפער בין שנת לידה של יוצרים מפורסמים לשנת פרסום יצירה ראשונה כדי לגלות בני כמה הם היו כשיצרו משהו (ידעתם שמאיר שלו נהיה סופר רק בגיל 40?)<br><br>
    3. כנראה שזה כדי לאמת לעצמי שאין גיל מובהק לדברים, שאני לא מאחר, שזה בסדר לקחת את הזמן כדי להבשיל.<br><br>
    4. מנגרג'ונה למדתי שזמן זה משהו שאנחנו המצאנו. לא, סליחה. שמות לזמן זה משהו שאנחנו המצאנו, שמונח על גבי המציאות כמות שהיא. איזה ערך יש למילה 'שנה' לדוגמא, ואיך ערך זה משתנה בין שנה במסלול בצבא? שנה בטיול הגדול? שנה מגיל 0 עד 1?<br><br>
    5. לקרוא בשמות לזמן נותן לי בעיקר את יכולת ההשוואה - מה אעשה בשעה הבאה? איך היה היום האחרון? כמה זמן לקח לי לרוץ עשרה קילומטרים הפעם?<br><br>
    6. האמת היא כנראה שהזמן הוא בסך הכל המסגרת הרציפה שבה הכל קורה לי. המסגרת שבה אני חי. בדיוק כמו אורך, רוחב ונפח.<br><br>
    7. אני לא יודע אם אני מרגיש בן עשרים ושבע שנים או שזו רק המדידה החיצונית, ואולי הכל כדי לא להפיל לעצמי את האסימון שאני בן 27 עוד מעט.<br><br>
    8. בספר קטן של עמוס עוז מצאתי סיפור יפה:<br>
    היה פעם כפר שכוח אל רגלי הקרפטים, כפר של שלושים בקתות ובו רק שני שעונים, אחד בבית הסטרוסטה שהוא זקן הכפר ואחד אצל הדיאקון, מעין כומר. יום אחד נעצר אחד השעונים והשני אבד, או להפך. נותר כל הכפר בלי זמן.<br>
    ובכן שלחו בחור אחד, זריז, יודע כתב, אל מעבר להר אל העיר נדוורנה, כדי שיביא להם מחדש את הזמן וישוב לכוון את השעון שעצר.<br>
    רכב הבחור חצי יום או יותר, הגיע לנדוורנה, מצא את שעון הרכבת, העתיק בזהירות על פתק את הזמן המדויק, קיפל והחביא את הפתק היקר בחגורתו ורכב בחזרה אל כפרו.
  `

  return (
    <BlogPost
      title="Thoughts on Time"
      date="2025-07-01"
      content={content}
      direction="rtl"
    />
  )
}

export default Zman